{
  "id": "e4p",
  "title": "E for P",
  "image": "",
  "description": "",
  "heading": "Exercises for Programmers",
  "sections": [
    {
      "intro-paragraph": "Here is where you will find the projects i've been involved in, a mix of personal and student projects.",
      "module": "e4p-grid",
      "chapters": [
        {
          "heading": "Input, Processing, and Output",
          "description": "These exercises provided me with a solid foundation in fundamental programming concepts such as input/output, and processing strings and numbers",
          "exercises": [1, 2, 3, 4, 5, 6]
        },
        {
          "heading": "Calculations",
          "description": "Here I covered a range of mathematical operations, such as working with exponents, computing compound interest, and performing calculations on time and dates",
          "exercises": [7, 8, 9, 10, 11, 12, 13]
        },
        {
          "heading": "Making Decisions",
          "description": "This chapter is all about making decisions. We learn to deal with if statements, comparisons, and logical operators",
          "exercises": [14, 15, 16, 17, 18, 19, 20, 21, 23]
        },
        {
          "heading": "Functions",
          "description": "Encapsulating code into functions is a key part of programming. how to write functions, how to call functions, and how to pass data to functions",
          "exercises": [24, 25, 26, 27]
        },
        {
          "heading": "Repetition",
          "description": "Loops, loops, loops. We loop through arrays, we loop through strings, we loop through numbers. We learn to deal with while loops, for loops, and nested loops.",
          "exercises": [28, 29, 30, 31, 32]
        },
        {
          "heading": "Data Structures",
          "description": "Learning to work with arrays, lists, and maps. storing and retrieving data, and manipulating data in these structures. ",
          "exercises": [33, 34, 35, 36, 37, 38, 39, 40]
        },
        {
          "heading": "Working with Files",
          "description": "Here we learn to work with files. We learn to read and write files, and how to parse data from files like JSON and CSV.",
          "exercises": [41, 42, 43, 44, 45, 46]
        },
        {
          "heading": "Working with External Services",
          "description": "These exercises help introduce the concept of APIs. We learn to work with APIs, and how to use them to retrieve data from external services.",
          "exercises": [47, 48, 49, 50, 51, 52]
        },
        {
          "heading": "Full Programs",
          "description": "These are fully fledged programs that combine, reinforce, and extend the concepts learned in the previous chapters.",
          "exercises": [53, 54, 55, 56, 57]
        }
      ]
    }
  ]
}
